{
  "name": "How to Start Alchemy",
  "icon": "magitech:zardius_crucible",
  "category": "magitech:alchemy_notes",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Alchemy is the art of using Mana to transform various things into other things.$(br2)The first thing that comes to mind might be boiling ingredients in a crucible or converting them on a pedestal, but there are many other methods."
    },
    {
      "type": "patchouli:text",
      "title": "What You Need for Alchemy",
      "text": "Assuming you don't have any devices yet, here are the items needed to start \"Zardius Alchemy,\" which you can craft yourself."
    },
    {
      "type": "patchouli:crafting",
      "title": "Zardius Alchemy Crucible",
      "text": "Think of it like a cooking pot.$(br)You put ingredients inside and boil them to perform Alchemy.",
      "recipe": "magitech:zardius_crucible",
      "link_recipe": "true"
    },
    {
      "type": "patchouli:spotlight",
      "title": "Heat Source",
      "text": "Place a heat source right under the crucible to bring it to a boil. This is essential for the crucible.",
      "item": "minecraft:campfire"
    },
    {
      "type": "patchouli:spotlight",
      "title": "Water or Other Liquids",
      "text": "This goes without saying, but water is required for this Alchemy.",
      "item": "minecraft:water_bucket"
    },
    {
      "type": "patchouli:spotlight",
      "title": "Materials to Use",
      "text": "The materials you need depend on what you want to create, so make sure to check carefully.",
      "item": "magitech:tourmaline"
    },
    {
      "type": "patchouli:spotlight",
      "title": "Mana",
      "text": "The key to Alchemy. Nothing happens if you forget to add this. Sometimes, instead of Mana, you use Alchemical Aspects. (At first, use fluorite charged with Mana.)",
      "item": "magitech:mana_charged_fluorite"
    },
    {
      "type": "patchouli:text",
      "title": "Common Failures in Alchemy",
      "text": "Alchemical Aspects created by Alchemy are extremely unstable compared to Mana, and if you're careless, explosions and other incidents happen frequently.$(br2)If no reaction occurs, check if the quantities other than liquids are incorrect.$(br)Don't force reactions, as accidents can happen."
    },
    {
      "type": "patchouli:text",
      "title": "More Detailed Explanation",
      "text": "Alchemical Aspects are also used in Magic, and almost all offensive spells shoot Alchemical Aspects.$(br2)Because Alchemical Aspects quickly transform into other energies, they have enormous destructive power upon impact compared to Mana.$(br2)This is why accidents happen, but Alchemical Aspects made by Alchemy can be safely contained in tourmaline or quartz."
    },
    {
      "type": "patchouli:text",
      "text": "When Alchemical Aspects transfer to other objects, part of them changes into another form of energy.$(br2)For example, the Ember Aspect becomes heat, the Phantom Aspect becomes light.$(br2)This allows various processing of materials.$(br)In a way, they act like the \"fuel\" of Alchemy."
    }
  ]
}