{
  "name": "Notes on the Path to Magic Use",
  "icon": "magitech:thread_page[magitech:thread_page_component={\"spell\":\"magitech:frigala\"}]",
  "category": "magitech:how_to_use_magic",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(li)Mana and Strands$(br2)$(li)Requirements for Using Magic$(br2)$(li)Mechanism Behind Magic Use$(br2)$(li)Common Mistakes$(br2)$(li)Actual Usage"
    },
    {
      "type": "patchouli:text",
      "title": "Mana and Strands",
      "text": "$(#808080)Mana is like the 'fuel for spells' that dissolves slightly into the air. It’s also present in small amounts in the human body and tools. It can be denser in highly active or oddly quiet locations. Usually gathered with alchemy equipment or drawn from trained individuals. $(br2)$(#000000)Mana appears in a blue container on the right side of the screen."
    },
    {
      "type": "patchouli:text",
      "text": "$(#808080)Strands are like conduits separate from mana. They don’t carry energy, but serve as channels for spell flow. There are three types: Noctis, Luminis, and Phraxia. If not aligned properly, magic may misfire or explode."
    },
    {
      "type": "patchouli:text",
      "text": "$(#808080)Large magical reactors use thick strand bundles, while portable gear uses thin and delicate ones. Strands also appear after casting and guide mana paths. $(br2)$(#000000)Strands show up in purple, gold, and white containers on the right of the screen. Without them, spell strength weakens."
    },
    {
      "type": "patchouli:text",
      "title": "What’s Needed to Use Magic",
      "text": "$(#000000)Anyone can use magic with the proper tools. But without proper combinations, it’s just paper and sticks. At minimum, you'll need these:"
    },
    {
      "type": "patchouli:spotlight",
      "title": "Threadbound",
      "text": "$(#000000)A kind of magical book. Insert thread pages into it and wear it to use magic.",
      "item": "magitech:glistening_lexicon",
      "link_recipe" : "true"
    },
    {
      "type": "patchouli:spotlight",
      "title": "Thread Page",
      "text": "$(#000000)A blueprint for magic. It may look like paper or cloth, but contains Aidos circuits to shape the spell’s flow.",
      "item": "magitech:thread_page[magitech:thread_page_component={\"spell\":\"magitech:frigala\"}]",
      "link_recipe" : "true"
    },
    {
      "type": "patchouli:spotlight",
      "title": "Wand (or Magical Device)",
      "text": "$(#000000)A device packed with components to activate spells. Comes in many forms, from small to stationary cannons.",
      "item": "magitech:wand[magitech:part_material_component={\"materials\":[\"magitech:iron\", \"magitech:iron\", \"magitech:iron\", \"magitech:iron\"]}]",
      "link_recipe" : "true"
    },
    {
      "type": "patchouli:text",
      "text": "$(#000000)$(li)Mana$(br)Fuel for spells. Without it, nothing works. Obtain from devices or your body.$(br2)$(li)Strands$(br)Pathways for magic. Stronger spells need accurate strands. Usually provided by devices. You can cast without them, but spells weaken."
    },
    {
      "type": "patchouli:text",
      "title": "How Magic is Produced",
      "text": "$(#808080)1. Mana is supplied from a mana source.$(br2)2. The Arcane Refractor converts it into an energy form called Alchemical Phase.$(br2)3. This energy flows into the thread and is shaped into a spell.$(br2)4. The processed energy is stored in the Arcanister."
    },
    {
      "type": "patchouli:text",
      "text": "$(#808080)5. Meanwhile, a strand supplier feeds strands into the wand.$(br2)6. Finally, the Conductor synchronizes the flow, and the Catalyst fires the spell. That’s how you get fire arrows, frozen enemies, and blasts of light."
    },
    {
      "type": "patchouli:text",
      "title": "Common Mistakes",
      "text": "$(#808080)Thread misconnection → No spell or incomplete spell.$(br2)Wand design flaw → Short range or only strands are released.$(br2)Strand disconnection → Wand burns or ignites.$(br2)Too much mana → Refractor warps or stops with loud noise.$(br2)Magic newbie → You hit yourself."
    },
    {
      "type": "patchouli:text",
      "title": "How to Use It Practically",
      "text": "$(#000000)1. Open Thread Page screen of your Threadbound (Default: [N])$(br2)2. Insert the thread page into the book$(br2)3. Equip it in Curios inventory$(br2)4. Hold the wand and right-click.$(br2)That’s all you need to master using magic."
    }
  ]
}